       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBCCONIF0.
       AUTHOR. ANDRES SILVA.   
       DATE-WRITTEN.  22/12/2023.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
      *----------------------------------------------------------------- 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *-----------------------------------------------------------------
            
      *----------------------------------------------------------------- 
       DATA DIVISION.
       FILE SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------  
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------------------  
      * SQL ------------------------------------------------------------
           EXEC SQL 
               INCLUDE SQLCA
           END-EXEC.
      *-----------------------------------------------------------------
      * Data Access ----------------------------------------------------
      *-----------------------------------------------------------------
       01  PLTFECHAS-REC.
           COPY DDS-REGFECHAS OF PLTFECHAS.
       01  OPGPCONTA-REC.
           COPY DDS-REGOPGPCON OF OPGPCONTA.    
      *-----------------------------------------------------------------
       LINKAGE SECTION.
      *-----------------------------------------------------------------
       01  W-CODEMP      PIC S9(05).
      *-----------------------------------------------------------------  
       PROCEDURE DIVISION  USING W-CODEMP.
      *----------------------------------------------------------------- 
       INICIAR PROGRAMA.
      *----------------------------------------------------------------- 
           PERFORM INICIAR.
           PERFORM PROCESAR.
           PERFORM FINALIZAR.
      *-----------------------------------------------------------------
       INICIAR.
      *----------------------------------------------------------------- 
           PERFORM READ-PLTFECHAS THRU F-READ-PLTFECHAS 
           .
      *-----------------------------------------------------------------
       PROCESAR.
      *----------------------------------------------------------------- 
           PERFORM DECLARE-CURSOR    THRU F-DECLARE-CURSOR
           PERFORM OPEN-CURSOR       THRU F-OPEN-CURSOR
           PERFORM READ-CURSOR       THRU F-READ-CURSOR
           PERFORM UNTIL  ( SQLCODE NOT EQUAL ZEROS )
               PERFORM PROCESAR-MOVIMIENTO-TARJETA
           END-PERFORM
           PERFORM CLOSE-CURSOR      THRU F-CLOSE-CURSOR
           .
      *-----------------------------------------------------------------
       PROCESAR-MOVIMIENTO-TARJETA.
      *-----------------------------------------------------------------     
      *-----------------------------------------------------------------
       DECLARE-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               DECLARE CURONE SCROLL CURSOR FOR 
                   SELECT * FROM MOVIMIENTO
           END-EXEC
           .    
      *-----------------------------------------------------------------
       F-DECLARE-CURSOR.
      *-----------------------------------------------------------------
           EXIT.         
      *-----------------------------------------------------------------
       OPEN-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               OPEN CURONE
           END-EXEC 
           . 
      *-----------------------------------------------------------------
       F-OPEN-CURSOR.
      *-----------------------------------------------------------------
           EXIT.  
      *-----------------------------------------------------------------
       READ-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               FETCH NEXT FROM CURONE INTO :REGMOVIMIENTO 
           END-EXEC 
           .
      *-----------------------------------------------------------------
       F-READ-CURSOR.
      *-----------------------------------------------------------------
           EXIT.       
      *-----------------------------------------------------------------
       CLOSE-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               CLOSE CURONE 
           END-EXEC 
           .     
      *-----------------------------------------------------------------
       F-CLOSE-CURSOR.
      *-----------------------------------------------------------------
           EXIT.
      *-----------------------------------------------------------------      
       FINALIZAR.
      *-----------------------------------------------------------------
           GOBACK. 
      *-----------------------------------------------------------------
       READ-PLTFECHAS.
      *----------------------------------------------------------------- 
           EXEC SQL 
               SELECT * INTO :REGFECHAS
                   FROM PLTFECHAS
               WHERE CODEMP = :W-CODEMP
           END-EXEC.
      *-----------------------------------------------------------------
       F-READ-PLTFECHAS.
      *-----------------------------------------------------------------
           EXIT.      
      *-----------------------------------------------------------------

       