       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBCCONIF0.
       AUTHOR. ANDRES SILVA.   
       DATE-WRITTEN.  22/12/2023.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
      *----------------------------------------------------------------- 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *-----------------------------------------------------------------
            
      *----------------------------------------------------------------- 
       DATA DIVISION.
       FILE SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------  
       WORKING-STORAGE SECTION.
      *-----------------------------------------------------------------  
      * SQL ------------------------------------------------------------
           EXEC SQL 
               INCLUDE SQLCA
           END-EXEC.
      *-----------------------------------------------------------------
       01  W-FECPRO             PIC S9(08).
       01  FILLER               REDEFINES W-FECPRO.
           03 W-FECAA-PRO       PIC 9(04).
           03 W-FECMM-PRO       PIC 9(02).
           03 W-FECDD-PRO       PIC 9(02).
       01  W-FECPER             PIC X(10).
       01  FILLER               REDEFINES W-FECPER.
           03 W-FECAA-PER       PIC 9(04).
           03 W-TAB001          PIC X(01).
           03 W-FECMM-PER       PIC 9(02).
           03 W-TAB002          PIC X(01).
           03 W-FECDD-PER       PIC 9(02).
      *-----------------------------------------------------------------
      * Data Access ----------------------------------------------------
      *-----------------------------------------------------------------
       01  PLTFECHAS-REC.
           COPY DDS-REGFECHAS OF PLTFECHAS.
       01  OPGPCONTA-REC.
           COPY DDS-REGOPGPCON OF OPGPCONTA.    
       01  CBCTRNMOV-REC.
           COPY DDS-REGTRNMON OF CBCTRNMOV.    
      *-----------------------------------------------------------------
       LINKAGE SECTION.
      *-----------------------------------------------------------------
       01  W-CODEMP      PIC S9(05).
      *-----------------------------------------------------------------  
       PROCEDURE DIVISION  USING W-CODEMP.
      *----------------------------------------------------------------- 
       INICIAR PROGRAMA.
      *----------------------------------------------------------------- 
           PERFORM INICIAR.
           PERFORM PROCESAR.
           PERFORM FINALIZAR.
      *-----------------------------------------------------------------
       INICIAR.
      *----------------------------------------------------------------- 
           PERFORM READ-PLTFECHAS THRU F-READ-PLTFECHAS 
           .
      *-----------------------------------------------------------------
       PROCESAR.
      *----------------------------------------------------------------- 
           PERFORM DECLARE-CURSOR    THRU F-DECLARE-CURSOR
           PERFORM OPEN-CURSOR       THRU F-OPEN-CURSOR
           PERFORM READ-CURSOR       THRU F-READ-CURSOR
           PERFORM UNTIL  ( SQLCODE NOT EQUAL ZEROS )
               PERFORM PROCESAR-MOVIMIENTO-TARJETA
           END-PERFORM
           PERFORM CLOSE-CURSOR      THRU F-CLOSE-CURSOR
           .
      *-----------------------------------------------------------------
       PROCESAR-MOVIMIENTO-TARJETA.
      *-----------------------------------------------------------------
           INITIALIZE REGOPGPCON
           MOVE "2101  "              TO IJUEGO OF REGOPGPCON
           MOVE "COP"                 TO CODDIV OF REGOPGPCON
           MOVE "Tarjeta de Credito TARCRED"
                                      TO IJUEGO OF REGOPGPCON
           MOVE FECPRO OF REGTRNMON   TO W-FECPRO
           MOVE W-FECAA-PRO           TO W-FECAA-PER
           MOVE W-FECMM-PRO           TO W-FECMM-PER
           MOVE W-FECDD-PRO           TO W-FECDD-PER
           MOVE "-"                   TO W-TAB001 W-TAB002
           MOVE W-FECPER              TO FECPER OF REGOPGPCON
                                         FECDOC OF REGOPGPCON
           EVALUATE ( TIPMOV OF REGTRNMON )
              WHEN ( 1 )  MOVE VLRTRN OF REGTRNMON
                                      TO VLRDEB OF REGOPGPCON
              WHEN ( 2 )  MOVE VLRTRN OF REGTRNMON
                                      TO VLRCRE OF REGOPGPCON
           END-EVALUATE                                                                                                
           PERFORM INSERT-OPGPCONTA   THRU F-INSERT-OPGPCONTA
           .
      *-----------------------------------------------------------------
       INSERT-OPGPCONTA.
      *-----------------------------------------------------------------
           EXEC SQL
               INSERT INTO OPGPCONTA
                   VALUES ( :REGOPGPCON) 
                   WITH NC 
           END-EXEC 
           IF ( SQLCODE = ZEROS )
               ROLLBACK
           ELSE
               COMMIT    
           END-IF
           .
      *-----------------------------------------------------------------
       F-INSERT-OPGPCONTA.
      *-----------------------------------------------------------------
           EXIT.      
      *-----------------------------------------------------------------
       DECLARE-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               DECLARE CURONE SCROLL CURSOR FOR 
                   SELECT * FROM CBCTRNMOV
           END-EXEC
           .    
      *-----------------------------------------------------------------
       F-DECLARE-CURSOR.
      *-----------------------------------------------------------------
           EXIT.         
      *-----------------------------------------------------------------
       OPEN-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               OPEN CURONE
           END-EXEC 
           . 
      *-----------------------------------------------------------------
       F-OPEN-CURSOR.
      *-----------------------------------------------------------------
           EXIT.  
      *-----------------------------------------------------------------
       READ-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               FETCH NEXT FROM CURONE INTO :REGTRNMON 
           END-EXEC 
           .
      *-----------------------------------------------------------------
       F-READ-CURSOR.
      *-----------------------------------------------------------------
           EXIT.       
      *-----------------------------------------------------------------
       CLOSE-CURSOR.
      *-----------------------------------------------------------------
           EXEC SQL
               CLOSE CURONE 
           END-EXEC 
           .     
      *-----------------------------------------------------------------
       F-CLOSE-CURSOR.
      *-----------------------------------------------------------------
           EXIT.
      *-----------------------------------------------------------------      
       FINALIZAR.
      *-----------------------------------------------------------------
           GOBACK. 
      *-----------------------------------------------------------------
       READ-PLTFECHAS.
      *----------------------------------------------------------------- 
           EXEC SQL 
               SELECT * INTO :REGFECHAS
                   FROM PLTFECHAS
               WHERE CODEMP = :W-CODEMP
           END-EXEC.
      *-----------------------------------------------------------------
       F-READ-PLTFECHAS.
      *-----------------------------------------------------------------
           EXIT.      
      *-----------------------------------------------------------------

       